; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	instrument13 - instrument
	satellite5 - satellite
	instrument14 - instrument
	instrument15 - instrument
	infrared0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star2 - direction
	Star6 - direction
	Star4 - direction
	GroundStation7 - direction
	Star1 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star6)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation9)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 GroundStation9)
	(calibration_target instrument6 Star2)
	(supports instrument7 infrared1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 infrared0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 Star4)
	(supports instrument11 infrared0)
	(calibration_target instrument11 GroundStation8)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
	(supports instrument12 infrared0)
	(supports instrument12 infrared1)
	(calibration_target instrument12 GroundStation7)
	(calibration_target instrument12 Star2)
	(calibration_target instrument12 GroundStation9)
	(supports instrument13 infrared1)
	(calibration_target instrument13 Star6)
	(calibration_target instrument13 Star4)
	(calibration_target instrument13 Star1)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument14 infrared0)
	(calibration_target instrument14 Star1)
	(calibration_target instrument14 GroundStation7)
	(calibration_target instrument14 Star4)
	(supports instrument15 infrared0)
	(supports instrument15 infrared1)
	(calibration_target instrument15 Star1)
	(on_board instrument14 satellite5)
	(on_board instrument15 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation8)
)
(:goal (and
	(pointing satellite3 GroundStation9)
	(pointing satellite4 Star14)
	(pointing satellite5 Star4)
	(have_image Star10 infrared0)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared1)
	(have_image Star14 infrared0)
))

)

; plan
1. (turn_to satellite5 star4 groundstation8)
   deleted: (pointing satellite5 groundstation8)
   added: (pointing satellite5 star4)
   goals met: 1 of 8
2. (turn_to satellite4 star14 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star14)
   goals met: 2 of 8
3. (turn_to satellite3 groundstation9 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 groundstation9)
   goals met: 3 of 8
4. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 3 of 8
5. (calibrate satellite2 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 3 of 8
6. (turn_to satellite2 planet13 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet13)
   goals met: 3 of 8
7. (take_image satellite2 planet13 instrument7 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 4 of 8
8. (turn_to satellite2 phenomenon12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon12)
   goals met: 4 of 8
9. (take_image satellite2 phenomenon12 instrument7 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 5 of 8
10. (turn_to satellite2 star10 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star10)
   goals met: 5 of 8
11. (take_image satellite2 star10 instrument7 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 8
12. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 6 of 8
13. (take_image satellite2 star11 instrument7 infrared1)
   added: (have_image star11 infrared1)
   goals met: 7 of 8
14. (turn_to satellite2 star14 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star14)
   goals met: 7 of 8
15. (take_image satellite2 star14 instrument7 infrared0)
   added: (have_image star14 infrared0)
   goals met: 8 of 8
